Revit 2024 API
DividedPath.IsValidSpacingRuleJustification Method
 Checks that the justification enumeration value is valid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsValidSpacingRuleJustification(
	SpacingRuleJustification justification
)
Visual Basic
Public Function IsValidSpacingRuleJustification ( _
	justification As SpacingRuleJustification _
) As Boolean
Visual C++
public:
bool IsValidSpacingRuleJustification(
	SpacingRuleJustification justification
)
Parameters
justification
Type: Autodesk.Revit.DB.SpacingRuleJustification
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DividedPath Class
Autodesk.Revit.DB Namespace